/*
	随机产生一个日期数据值：调用随机函数，所发生数除9999取余，再加1，该数为年份值；
	再调用随机函数，所发生数除12取余，再加1，该数为月份值；再调用随机函数，所发生数除31取余，再加1，该数为日值。
	键盘输入当天日期，比较两个日期数据值大小。
	例如随机产生日期数据值为3017-10-29，键盘输入日期数据值为2017-3-10，则输出“随机日期大于当天日期”。
*/
#include<iostream>
#include<cmath>
#include<time.h>
using namespace std;
int main()
{
	int y1, y2, m1, m2, d1, d2;

	srand(time(NULL));
	y1 = rand() % 9999 + 1;
	m1 = rand() % 12 + 1;
	d1 = rand() % 31 + 1;

	cout << "输入你的日期:\n年:";
	cin >> y2;
	cout << "月:";
	cin >> m2;
	cout << "日:";
	cin >> d2;

	if ((y1 > y2) || (y1 <= y2 && m1 > m2) || (y1 <= y2 && m1 <= m2 && d1 > d2))
	{
		cout << "随机日期大于当天日期\n";
	}
	else {
		if (y1 == y2 && m1 == m2 && d1 == d2)
		{
			cout << "随机日期等于当天日期\n";
		}
		else
		{
			cout << "随机日期小于当天日期\n";
		}
	}
}
